OpenFOAMcases/2DCJ/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          81920;
        startFace       163200;
    }
    bottom
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          320;
        startFace       245120;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          81920;
        startFace       245440;
    }
    inlet
    {
        type            patch;
        nFaces          128;
        startFace       327360;
    }
    jet
    {
        type            patch;
        nFaces          128;
        startFace       327488;
    }
    jetwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       327616;
    }
    outlet
    {
        type            patch;
        nFaces          256;
        startFace       327744;
    }
    top
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          320;
        startFace       328000;
    }
)

// ************************************************************************* //
