OpenFOAMcases/2DCJ/system/surfaces.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2106
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   raw;
interpolationScheme cellPoint;

x (1 0 0);
y (0 1 0);
z (0 0 1);
origin (0 -0.5 1);

cuttingPlane
{
    type         cuttingPlane;
    planeType    pointAndNormal;
    pointAndNormalDict
    {
        point    $origin;
        normal   $x;
    }
    interpolate  false;
}

isosurface
{
    type            isoSurfaceCell;
    interpolate     true;
}

patchSurface
{
    type        patch;
    interpolate false;
}

// ************************************************************************* //
